[
  "What's the best thing about Switzerland? The flag is a big plus.",
  "I found a lion in my closet the other day! When I asked what it was doing there, it said “Narnia business.”",
  "I went to the aquarium this weekend, but I didn’t stay long. There’s something fishy about that place.",
  "What's a cat's favorite instrument? Purr-cussion.",
  "Why did the snail paint a giant S on his car? So when he drove by, people could say: “Look at that S car go!”",
  "Some people pick their nose, but I was born with mine.",
  "I can always tell when someone is lying. I can tell when they're standing too.",
  "What's the coolest element in the periodic table? Ber-yllium",
  "I used to be afraid of speed bumps. I'm trying to get over it.",
  "If your house is cold, just stand in the corner. It’s always 90 degrees there.",
  "What falls, but never needs a bandage? The rain.",
  "I'm not a fan of spring cleaning. Let's be honest, I'm not into summer, fall, or winter cleaning either.",
  "I was going to tell you a joke about boxing but I forgot the punch line.",
  "Why did the egg hide? It was a little chicken.",
  "What did the dirt say to the rain? If you keep this up, my name will be mud!",
  "Bakit maswerte ang kalendaryo? Kasi maraming siyang date.",
  "Ano'ng tawag ng batang langgam sa kapatid na babae ng nanay niya? Eh 'di... ANTY!",
  "Ano ang binibigay ng doktor sa ibong may sakit? Eh 'di... TWEETMENT!",
  "May tatlong lalake na tumalon sa tubig, ilan ang nabasa ang buhok? Wala. Kalbo silang lahat eh.",
  "Bakit malungkot ang kalendaryo? Kasi bilang na ang araw niya.",
  "Ano ang pagkakaparehas ng UTOT at TULA? Pareho silang nagmula sa POET.",
  "Ano ang maraming sakay, jeep o ambulansya? Syempre ang ambulansya! Kasi, ang jeep ay 10-10 lang ang bawat side samantalang sa ambulansya, madalas na 50-50 ang sakay.",
  "Ano ang makukuha mo sa baboy na magaling mag-karate? Eh 'di... PORK CHOP!",
  "Ano ang pinakatamad na letter sa English alphabet? Letrang E, kasi laging nasa BED eh!",
  "Ano'ng kinakain ng mga pusa sa umaga? Eh 'di MICE KRISPIES!",
  "Pa'no mo hahatiin sa dalawa ang dagat? Gumamit ka ng SEASAW!",
  "Hulaan mo kung sa'n iniiwan ng mga aso ang kotse nila... sa BARKING LOT!",
  "Ano'ng puno ang hindi pwedeng akyatin? 'Yung nakatumba!",
  "Ano'ng bagay ang nagsisimula sa T at nagtatapos sa T at may T rin sa loob? Eh 'di... TEAPOT!",
  "Ano'ng gamot sa mga sugat ng balat ng baboy? OINKMENT!",
  "Hulaan mo ang paboritong palaman sa tinapay ng astronaut. Eh 'di LAUNCHEON meat!",
  "Ano ang pwede mong gawin sa GABI na hindi mo pwedeng gawin sa UMAGA? Eh 'di... MAGPUYAT.",
  "Ano'ng room ang walang dingding at pinto? Eh 'di MUSHROOM!",
  "Ang common na sakit ng mga martial arts champions ay... KUNG FLU!",
  "Saan nagpapagupit ang mga tupa? Sa baa-baa shop!",
  "Ano'ng gulay ang marunong maglaro ng billiards? Eh 'di... CUE-CUMBER!",
  "Ano'ng TV show ang pinapanood ng mga bibi? Eh 'di... DUCKUMENTARIES!",
  "Ano'ng pagkakaiba ng Biology at Sociology? 'Pag kamukha ng tatay ang sanggol, Biology ‘yon. 'Pag kamukha naman ng kapitbahay ninyo ang sanggol, sociology ‘yon.",
  "Saan nagdedeposit ang mga bampira? Eh 'di sa BLOOD BANK!",
  "Ano'ng mangyayari 'pag nahulog mo ang isang pulang sumbrero sa asul na dagat? Eh 'di mababasa yung sumbrero!",
  "Alam mo ba kung ano 'yung minamanehong sasakyan ni Jollibee? Eh 'di... BEE-M-W!",
  "Bakit gising magdamag ang mga bampira? Kasi nag-aaral sila para sa kanilang blood test!",
  "Bakit madaling timbangin ang mga isda? May sarili silang SCALES eh!",
  "Ano'ng mas nakakadiri sa uod na nakita mo sa prutas mo? Eh 'di yung kalahating uod na lang! (Ewww)",
  "Ano ang pinakamataas na building sa buong mundo? Eh 'di yung library, kasi maraming STORIES doon!",
  "Ano'ng tawag sa doctor ng mga fish? Eh 'di... FISHician! (Physician)",
  "Sino'ng nanay ni Pikachu? Eh 'di si... Cherry Pie PIKACHU.",
  "Ano'ng sabi ng isda nang hiwain siya sa gitna? Eh 'di... I’m tuna (two na).",
  "Bakit may K ang dark imbes na C? Eh kasi you can't C in the dark.",
  "Ano'ng buhok ang pumuputok? BANGS!",
  "Ano namang tawag sa tropa mong pandak? Eh 'di... Li' 'Tol.",
  "Ano'ng makukuha mo 'pag piniga mo ang isang pari? Eh 'di... ReliJuice (minus ligtas points again).",
  "Anong isda ang hindi nababasa? Eh 'di... tuyo (dried)!",
  "Ano'ng sabi ng baboy nung nakita niya 'yung baka? Meat tayo!",
  "Ano ang bulletproof na isda? Eh 'di... Pating!"
]